src/main/resources/sample_reservation_response.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <ns6:nsiHeader xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://www.w3.org/2001/04/xmlenc#"
                       xmlns:ns4="urn:oasis:names:tc:SAML:2.0:assertion"
                       xmlns:ns5="http://schemas.ogf.org/nsi/2013/07/connection/types"
                       xmlns:ns6="http://schemas.ogf.org/nsi/2013/07/framework/headers">
            <protocolVersion>urn:2.0:FIXME</protocolVersion>
            <correlationId>urn:uuid:f81d4fae-7dec-11d0-a765-00a0c91e6bf6</correlationId>
            <requesterNSA>urn:ogf:network:nsa:foo</requesterNSA>
            <providerNSA>urn:ogf:network:nsa:surfnet.nl</providerNSA>
        </ns6:nsiHeader>
    </S:Header>
    <S:Body>
        <ns5:reserveConfirmed xmlns:ns2="http://www.w3.org/2000/09/xmldsig#"
                              xmlns:ns3="http://www.w3.org/2001/04/xmlenc#"
                              xmlns:ns4="urn:oasis:names:tc:SAML:2.0:assertion"
                              xmlns:ns5="http://schemas.ogf.org/nsi/2013/07/connection/types"
                              xmlns:ns6="http://schemas.ogf.org/nsi/2013/07/framework/headers">
            <connectionId>2c1f448b-757f-4b4b-a4c6-8fba5e788dea</connectionId>
            <globalReservationId>urn:nl:surfnet:diensten:bod:9c03b5e1-b86c-44ce-83ac-a164541dbda2</globalReservationId>
            <description>NSI v2 Reservation</description>
            <criteria version="0">
                <schedule>
                    <startTime>2013-06-12T16:11:00+02:00</startTime>
                    <endTime>2013-06-12T15:11:00+02:00</endTime>
                </schedule>
                <bandwidth>100</bandwidth>
                <serviceAttributes/>
                <path>
                    <directionality>Bidirectional</directionality>
                    <sourceSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>1700</localId>
                    </sourceSTP>
                    <destSTP>
                        <networkId>urn:ogf:network:stp:surfnet.nl</networkId>
                        <localId>1705</localId>
                    </destSTP>
                </path>
            </criteria>
        </ns5:reserveConfirmed>
    </S:Body>
</S:Envelope>